Revit 2024 API
BuiltInFailures.MacroFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.MacroFailures type exposes the following members.
Properties
Name | Description
DuplicateModuleName
 Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed.
See Also
BuiltInFailures.MacroFailures Class
Autodesk.Revit.DB Namespace